"""
0. 예제로 사용할 Graph(Directed and Undirected Graph) 생성
    1. 인접 리스트로?
    2. 인접 행렬로 ?
    3. 둘다?
1. BFS 구현
    0. BFS는 구현할때, Undirected Graph로..?
2. DFS 구현
    0. DFS는 대부분 Directed Graph임
    1. Topological sort 구현(예제 그래프 필요)
    2. Strongly connected Graph(예제 그래프 필요)
3. Euler Tour 공부?->이건 뭐임??ㅋㅋㅋ
"""
"""BFS 예제 Graph의 인접행렬"""
matrix1 = [[0, 1, 0, 0, 1, 0, 0, 0], #r
           [1, 0, 0, 0, 0, 1, 0, 0], #s
           [0, 0, 0, 1, 0, 1, 1, 0], #t
           [0, 0, 1, 0, 0, 0, 1, 1], #u
           [1, 0, 0, 0, 0, 0, 0, 0], #v
           [0, 1, 1, 0, 0, 0, 1, 0], #w
           [0, 0, 1, 1, 0, 1, 0, 1], #x
           [0, 0, 0, 1, 0, 0, 1, 0]] #y

"""DFS 예제 Graph의 인접행렬1"""
matrix2 = [[0, 1, 0, 1, 0, 0], #u
           [0, 0, 0, 0, 1, 0], #v
           [0, 0, 0, 0, 1, 1], #w
           [0, 1, 0, 0, 0, 0], #x
           [0, 0, 0, 1, 0, 0], #y
           [0, 0, 0, 0, 0, 1]] #z
"""DFS 예제 Graph의 인접행렬2"""
matrix3 = [[0, 0, 0, 0, 1, 0, 0, 1], #s
           [0, 0, 1, 1, 0, 0, 0, 0], #t
           [0, 1, 0, 1, 0, 0, 0, 0], #u
           [1, 0, 0, 0, 1, 0, 0, 0], #v
           [0, 0, 0, 0, 0, 1, 0, 0], #w
           [0, 0, 0, 0, 0, 0, 0, 1], #x
           [0, 0, 0, 0, 0, 1, 0, 0], #y
           [0, 0, 0, 0, 1, 0, 1, 0]] #z
